<?php
// Този код пренасочва потребителя към страницата за вход (login.php)
	if (!empty($_SERVER['HTTPS']) && ('on' == $_SERVER['HTTPS'])) { // Проверява дали връзката е HTTPS
		$uri = 'https://'; // Ако е HTTPS, задава префикс "https://"
	} else {
		$uri = 'http://'; // Ако не е HTTPS, задава префикс "http://"
	}
	$uri .= $_SERVER['HTTP_HOST']; // Добавя името на хоста (например "localhost" или "example.com")
	header('Location: '.$uri.'/baby/php/common/login.php'); // Пренасочва потребителя към страницата за вход (login.php)
	exit; // Спира изпълнението на скрипта, за да не се изпълнява нищо след пренасочването

// $uri - променлива, която държи основния адрес, към който ще бъде добавен пътя за пренасочване
// uri --> Uniform Resource Identifier (URI) --> общ термин за адреси като URL
// нашата уеб - базирана среда работи локално
// $_SERVER е суперглобален масив в PHP, който съдържа информация за сървъра и заявката от клиента (браузъра).
// Ако $_SERVER['HTTPS'] е on, значи сайтът използва защитена връзка.
?>
