<?php
// Файлът config.php съдържа връзката към базата данни, което означава, че всеки PHP файл, който го include-ва, ще има достъп до MySQL базата.
// Конфигурационен файл, който съдържа информация за връзката с базата данни

// Създава връзка с MySQL сървъра
$conn = mysqli_connect('localhost', 'root', 'loveCode9;', 'baby') 
or die('Connection problem'); // Ако има грешка, скриптът спира и показва съобщение

// localhost --> Адресът на MySQL сървъра (локално за XAMPP)
// root --> Потребителското име за MySQL (по подразбиране в XAMPP е root)
// loveCode9; --> Паролата за достъп
// baby --> име на базата данни