<?php
include 'common/config.php'; // Включваме config.php, за да използваме връзката с базата данни

session_start(); // Старт на сесията. Това е необходимо, за да имаме достъп до текущата сесия и да манипулираме сесийните данни
session_unset(); // Изчистваме всички сесийни променливи, което означава, че всички данни, съхранени в сесията (например потребителска информация), ще бъдат премахнати
session_destroy(); // Унищожаваме самата сесия. Това премахва всичко свързано с текущата сесия, включително самия сесионен идентификатор

header('location:login.php'); // Пренасочваме потребителя към страницата "login.php" (страницата за вход), след като е излязъл от сесията
?>